In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [2]:
data_kopi = {
    'Menu': ['Kopi Susu Gula Aren', 'Americano', 'Cappuccino', 'Matcha Latte', 'Chocolate Ice',
             'Espresso', 'Red Velvet', 'Affogato', 'Tea Tarik', 'Mineral Water'],
    'Category': ['Coffee', 'Coffee', 'Coffee', 'Non-Coffee', 'Non-Coffee',
                 'Coffee', 'Non-Coffee', 'Coffee', 'Non-Coffee', 'Non-Coffee'],
    'Price': [18000, 15000, 22000, 25000, 20000,
              12000, 23000, 28000, 15000, 5000],
    'Cups_Sold': [120, 80, 65, 50, 90,
                  40, 45, 30, 75, 100],
    'Cost_Per_Cup': [10000, 8000, 15000, 18000, 12000,
                     7000, 16000, 20000, 8000, 2000]
}

kopi_senja = pd.DataFrame(data_kopi)
kopi_senja.head()

                  Menu    Category  Price  Cups_Sold  Cost_Per_Cup
0  Kopi Susu Gula Aren      Coffee  18000        120         10000
1            Americano      Coffee  15000         80          8000
2           Cappuccino      Coffee  22000         65         15000
3         Matcha Latte  Non-Coffee  25000         50         18000
4        Chocolate Ice  Non-Coffee  20000         90         12000

In [4]:
# Hitung Profit
# Rumus: Profit = (Price - Cost_Per_Cup) * Cups_Sold
profit = (kopi_senja['Price'] - kopi_senja['Cost_Per_Cup']) * kopi_senja['Cups_Sold']
kopi_senja['Profit'] = profit
kopi_senja.head()

                  Menu    Category  Price  Cups_Sold  Cost_Per_Cup  Profit
0  Kopi Susu Gula Aren      Coffee  18000        120         10000  960000
1            Americano      Coffee  15000         80          8000  560000
2           Cappuccino      Coffee  22000         65         15000  455000
3         Matcha Latte  Non-Coffee  25000         50         18000  350000
4        Chocolate Ice  Non-Coffee  20000         90         12000  720000

In [ ]:
# Sortir berdasarkan Profit
kopi_senja_sorted = kopi_senja.sort_values(by='Profit', ascending=False)
kopi_senja_sorted

                  Menu    Category  Price  Cups_Sold  Cost_Per_Cup  Profit
0  Kopi Susu Gula Aren      Coffee  18000        120         10000  960000
4        Chocolate Ice  Non-Coffee  20000         90         12000  720000
1            Americano      Coffee  15000         80          8000  560000
8            Tea Tarik  Non-Coffee  15000         75          8000  525000
2           Cappuccino      Coffee  22000         65         15000  455000
3         Matcha Latte  Non-Coffee  25000         50         18000  350000
6           Red Velvet  Non-Coffee  23000         45         16000  315000
9        Mineral Water  Non-Coffee   5000        100          2000  300000
7             Affogato      Coffee  28000         30         20000  240000
5             Espresso      Coffee  12000         40          7000  200000

In [6]:
# Filter menu Hemat dan Non-Coffee
hemat_non_coffee = kopi_senja[
    (kopi_senja['Price'] < 20000) & (kopi_senja['Category'] == 'Non-Coffee')
]
hemat_non_coffee

            Menu    Category  Price  Cups_Sold  Cost_Per_Cup  Profit
8      Tea Tarik  Non-Coffee  15000         75          8000  525000
9  Mineral Water  Non-Coffee   5000        100          2000  300000